---
kind: type
id: T:Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs
source: html/1aa44a28-c45d-d77b-ced8-3b5cd5e582f3.htm
---
# Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs

The event arguments used by the DockableFrameActivatedChanged event.

## Syntax (C#)
```csharp
public class DockableFrameFocusChangedEventArgs : RevitAPISingleEventArgs
```